'use strict';

/**
 * Объект со всеми вопросами, ответами и вариантами ответов.
 */
const questions = [
    {
        text: 'Что из этого не является косметическим средством?',
        answer: 'Татуировка',
        answerOptions: {
            a: 'Помада',
            b: 'Татуировка',
            c: 'Крем',
            d: 'Пудра'
        }
    },
    {
        text: 'Кто, в конце концов, скушал Колобка?',
        answer: 'Лиса',
        answerOptions: {
            a: 'Дед',
            b: 'Баба',
            c: 'Заяц',
            d: 'Лиса'
        }
    },
    {
        text: 'Какой шахматной фигуры не существует?',
        answer: 'Дама',
        answerOptions: {
            a: 'Пешка',
            b: 'Конь',
            c: 'Король',
            d: 'Дама'
        }
    },
    {
        text: 'Что означает буква «О» в аббревиатуре ОРТ?',
        answer: 'Общественное',
        answerOptions: {
            a: 'Олигархическое',
            b: 'Объективное',
            c: 'Общественное',
            d: 'Однообразное'
        }
    },
    {
        text: 'Главный герой в романе Ф. И. Достоевского «Преступление и наказание»',
        answer: 'Раскольников',
        answerOptions: {
            a: 'Расторгуев',
            b: 'Чикатило',
            c: 'Тумбочкин',
            d: 'Раскольников'
        }
    },
    {
        text: 'В состав любого органического вещества входит…',
        answer: 'углерод',
        answerOptions: {
            a: 'кислород',
            b: 'углерод',
            c: 'водород',
            d: 'азот'
        }
    },
    {
        text: 'Какое слово здесь лишнее?',
        answer: 'Ворот',
        answerOptions: {
            a: 'Автор',
            b: 'Товар ',
            c: 'Отвар',
            d: 'Ворот'
        }
    },
    {
        text: 'Как назывался самый младший гражданский чин, присваивавшийся согласно Табели о рангах?',
        answer: 'Коллежский регистратор',
        answerOptions: {
            a: 'Синодский регистратор',
            b: 'Провинциальный секретарь',
            c: 'Коллежский регистратор',
            d: 'Кабинетский регистратор'
        }
    },
    {
        text: 'Кто изобрел громоотвод?',
        answer: 'Франклин',
        answerOptions: {
            a: 'Франклин',
            b: 'Рузвельт',
            c: 'Вашингтон',
            d: 'Линкольн'
        }
    },
    {
        text: 'В каком городе находится штаб-квартира Microsoft?',
        answer: 'Редмонд',
        answerOptions: {
            a: 'Нью-Йорк',
            b: 'Редмонд',
            c: 'Новый Орлеан',
            d: 'Сиэтл'
        }
    }
];
